Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G452.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device
    schemaVersion="1.3"
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
    xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
    <vendor>Nationstech Ltd.</vendor>
    <vendorID>NS</vendorID>
    <name>N32G452</name>
    <version>1.0</version>
    <description>N32G452</description>

    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <size>32</size>
    <access>read-write</access>
    <resetValue>0</resetValue>
    <resetMask>0xffffffff</resetMask>

    <peripherals>
    <peripheral>
    <name>ADC1</name>
    <description>analog to digital converter</description>
    <groupName>ADC</groupName>
    <baseAddress>0x40020800</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x68</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>ADC1_2</name>
        <description>ADC1/ADC2 global interrupt</description>
        <value>18</value>
    </interrupt>
    <registers>
<register>
  <name>ADC_STS</name>
  <displayName>ADC_STS</displayName>
  <description>ADC_STS</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000007f</resetMask>
  <fields>
    <field>
      <name>AWDG</name>
      <description>AWDG</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ENDC</name>
      <description>ENDC</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>JENDC</name>
      <description>JENDC</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>JSTR</name>
      <description>JSTR</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>STR</name>
      <description>STR</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ENDCA</name>
      <description>ENDCA</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>JENDCA</name>
      <description>JENDCA</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_CTRL1</name>
  <displayName>ADC_CTRL1</displayName>
  <description>ADC_CTRL1</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00ffffff</resetMask>
  <fields>
    <field>
      <name>AWDGCH</name>
      <description>AWDGCH</description>
      <bitOffset>0</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>ENDIEN</name>
      <description>ENDIEN</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>AWDGIEN</name>
      <description>AWDGIEN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>JENDCIEN</name>
      <description>JENDCIEN</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SCANMD</name>
      <description>SCANMD</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>AWDGSGLEN</name>
      <description>AWDGSGLEN</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>AUTOJC</name>
      <description>AUTOJC</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DREGCH</name>
      <description>DREGCH</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DJCH</name>
      <description>DJCH</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DTU</name>
      <description>DTU</description>
      <bitOffset>13</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>DUSEL</name>
      <description>DUSEL</description>
      <bitOffset>16</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>AWDGEJCH</name>
      <description>AWDGEJCH</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>AWDGERCH</name>
      <description>AWDGERCH</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_CTRL2</name>
  <displayName>ADC_CTRL2</displayName>
  <description>ADC_CTRL2</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00fef907</resetMask>
  <fields>
    <field>
      <name>ON</name>
      <description>ON</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTU</name>
      <description>CTU</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ENCAL</name>
      <description>ENCAL</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ENDMA</name>
      <description>ENDMA</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ALIG</name>
      <description>ALIG</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EXTJSEL</name>
      <description>EXTJSEL</description>
      <bitOffset>12</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>EXTJTRIG</name>
      <description>EXTJTRIG</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EXTRSEL</name>
      <description>EXTRSEL</description>
      <bitOffset>17</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>EXTRTRIG</name>
      <description>EXTRTRIG</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SWSTRJCH</name>
      <description>SWSTRJCH</description>
      <bitOffset>21</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SWSTRRCH</name>
      <description>SWSTRRCH</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TEMPEN</name>
      <description>TEMPEN</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_SMPR1</name>
  <displayName>ADC_SMPR1</displayName>
  <description>ADC_SMPR1</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00ffffff</resetMask>
  <fields>
    <field>
      <name>SAMP10</name>
      <description>SAMP10</description>
      <bitOffset>0</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SAMP11</name>
      <description>SAMP11</description>
      <bitOffset>3</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SAMP12</name>
      <description>SAMP12</description>
      <bitOffset>6</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SAMP13</name>
      <description>SAMP13</description>
      <bitOffset>9</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SAMP14</name>
      <description>SAMP14</description>
      <bitOffset>12</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SAMP15</name>
      <description>SAMP15</description>
      <bitOffset>15</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SAMP16</name>
      <description>SAMP16</description>
      <bitOffset>18</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SAMP17</name>
      <description>SAMP17</description>
      <bitOffset>21</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_SMPR2</name>
  <displayName>ADC_SMPR2</displayName>
  <description>ADC_SMPR2</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x3fffffff</resetMask>
  <fields>
    <field>
      <name>SAMP0</name>
      <description>SAMP0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SAMP1</name>
      <description>SAMP1</description>
      <bitOffset>3</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SAMP2</name>
      <description>SAMP2</description>
      <bitOffset>6</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SAMP3</name>
      <description>SAMP3</description>
      <bitOffset>9</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SAMP4</name>
      <description>SAMP4</description>
      <bitOffset>12</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SAMP5</name>
      <description>SAMP5</description>
      <bitOffset>15</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SAMP6</name>
      <description>SAMP6</description>
      <bitOffset>18</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SAMP7</name>
      <description>SAMP7</description>
      <bitOffset>21</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SAMP8</name>
      <description>SAMP8</description>
      <bitOffset>24</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SAMP9</name>
      <description>SAMP9</description>
      <bitOffset>27</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_JOFFSET1</name>
  <displayName>ADC_JOFFSET1</displayName>
  <description>ADC_JOFFSET1</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000fff</resetMask>
  <fields>
    <field>
      <name>OFFSETJCH2</name>
      <description>OFFSETJCH2</description>
      <bitOffset>0</bitOffset>
      <bitWidth>12</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_JOFFSET2</name>
  <displayName>ADC_JOFFSET2</displayName>
  <description>ADC_JOFFSET2</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000fff</resetMask>
  <fields>
    <field>
      <name>OFFSETJCH2</name>
      <description>OFFSETJCH2</description>
      <bitOffset>0</bitOffset>
      <bitWidth>12</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_JOFFSET3</name>
  <displayName>ADC_JOFFSET3</displayName>
  <description>ADC_JOFFSET3</description>
  <addressOffset>0x1c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000fff</resetMask>
  <fields>
    <field>
      <name>OFFSETJCH3</name>
      <description>OFFSETJCH3</description>
      <bitOffset>0</bitOffset>
      <bitWidth>12</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_JOFFSET4</name>
  <displayName>ADC_JOFFSET4</displayName>
  <description>ADC_JOFFSET4</description>
  <addressOffset>0x20</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000fff</resetMask>
  <fields>
    <field>
      <name>OFFSETJCH4</name>
      <description>OFFSETJCH4</description>
      <bitOffset>0</bitOffset>
      <bitWidth>12</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_WDGHIGH</name>
  <displayName>ADC_WDGHIGH</displayName>
  <description>ADC_WDGHIGH</description>
  <addressOffset>0x24</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>HTH</name>
      <description>HTH</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_WDGLOW</name>
  <displayName>ADC_WDGLOW</displayName>
  <description>ADC_WDGLOW</description>
  <addressOffset>0x28</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>LTH</name>
      <description>LTH</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_RSEQ1</name>
  <displayName>ADC_RSEQ1</displayName>
  <description>ADC_RSEQ1</description>
  <addressOffset>0x2c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00ffffff</resetMask>
  <fields>
    <field>
      <name>SEQ13</name>
      <description>SEQ13</description>
      <bitOffset>0</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SEQ14</name>
      <description>SEQ14</description>
      <bitOffset>5</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SEQ15</name>
      <description>SEQ15</description>
      <bitOffset>10</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SEQ16</name>
      <description>SEQ16</description>
      <bitOffset>15</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>LEN</name>
      <description>LEN</description>
      <bitOffset>20</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_RSEQ2</name>
  <displayName>ADC_RSEQ2</displayName>
  <description>ADC_RSEQ2</description>
  <addressOffset>0x30</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x3fffffff</resetMask>
  <fields>
    <field>
      <name>SEQ7</name>
      <description>SEQ7</description>
      <bitOffset>0</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SEQ8</name>
      <description>SEQ8</description>
      <bitOffset>5</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SEQ9</name>
      <description>SEQ9</description>
      <bitOffset>10</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SEQ10</name>
      <description>SEQ10</description>
      <bitOffset>15</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SEQ11</name>
      <description>SEQ11</description>
      <bitOffset>20</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SEQ12</name>
      <description>SEQ12</description>
      <bitOffset>25</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_RSEQ3</name>
  <displayName>ADC_RSEQ3</displayName>
  <description>ADC_RSEQ3</description>
  <addressOffset>0x34</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x3fffffff</resetMask>
  <fields>
    <field>
      <name>SEQ1</name>
      <description>SEQ1</description>
      <bitOffset>0</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SEQ2</name>
      <description>SEQ2</description>
      <bitOffset>5</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SEQ3</name>
      <description>SEQ3</description>
      <bitOffset>10</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SEQ4</name>
      <description>SEQ4</description>
      <bitOffset>15</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SEQ5</name>
      <description>SEQ5</description>
      <bitOffset>20</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>SEQ6</name>
      <description>SEQ6</description>
      <bitOffset>25</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_JSEQ</name>
  <displayName>ADC_JSEQ</displayName>
  <description>ADC_JSEQ</description>
  <addressOffset>0x38</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x003fffff</resetMask>
  <fields>
    <field>
      <name>JSEQ1</name>
      <description>JSEQ1</description>
      <bitOffset>0</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>JSEQ2</name>
      <description>JSEQ2</description>
      <bitOffset>5</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>JSEQ3</name>
      <description>JSEQ3</description>
      <bitOffset>10</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>JSEQ4</name>
      <description>JSEQ4</description>
      <bitOffset>15</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>JLEN</name>
      <description>JLEN</description>
      <bitOffset>20</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_JDAT1</name>
  <displayName>ADC_JDAT1</displayName>
  <description>ADC_JDAT1</description>
  <addressOffset>0x3c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>JDAT1</name>
      <description>JDAT1</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_JDAT2</name>
  <displayName>ADC_JDAT2</displayName>
  <description>ADC_JDAT2</description>
  <addressOffset>0x40</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>JDAT2</name>
      <description>JDAT2</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_JDAT3</name>
  <displayName>ADC_JDAT3</displayName>
  <description>ADC_JDAT3</description>
  <addressOffset>0x44</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>JDAT3</name>
      <description>JDAT3</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_JDAT4</name>
  <displayName>ADC_JDAT4</displayName>
  <description>ADC_JDAT4</description>
  <addressOffset>0x48</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>JDAT4</name>
      <description>JDAT4</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_JDAT</name>
  <displayName>ADC_JDAT</displayName>
  <description>ADC_JDAT</description>
  <addressOffset>0x4c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>JDAT</name>
      <description>JDAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_DIFSEL</name>
  <displayName>ADC_DIFSEL</displayName>
  <description>ADC_DIFSEL</description>
  <addressOffset>0x50</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0007fffe</resetMask>
  <fields>
    <field>
      <name>DIFSEL</name>
      <description>DIFSEL</description>
      <bitOffset>1</bitOffset>
      <bitWidth>18</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_CALFACT</name>
  <displayName>ADC_CALFACT</displayName>
  <description>ADC_CALFACT</description>
  <addressOffset>0x54</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x007f007f</resetMask>
  <fields>
    <field>
      <name>CALFACTS</name>
      <description>CALFACTS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>7</bitWidth>
    </field>
    <field>
      <name>CALFACTD</name>
      <description>CALFACTD</description>
      <bitOffset>16</bitOffset>
      <bitWidth>7</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_CTRL3</name>
  <displayName>ADC_CTRL3</displayName>
  <description>ADC_CTRL3</description>
  <addressOffset>0x58</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000fff</resetMask>
  <fields>
    <field>
      <name>RES</name>
      <description>RES</description>
      <bitOffset>0</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>CALDIF</name>
      <description>CALDIF</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CALALD</name>
      <description>CALALD</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CKMOD</name>
      <description>CKMOD</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RDY</name>
      <description>RDY</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PDRDY</name>
      <description>PDRDY</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BPCAL</name>
      <description>BPCAL</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ENDCAIEN</name>
      <description>ENDCAIEN</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>JENDCAIEN</name>
      <description>JENDCAIEN</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DPWMOD</name>
      <description>DPWMOD</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>VBATMEN</name>
      <description>VBATMEN</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ADC_SAMPT3</name>
  <displayName>ADC_SAMPT3</displayName>
  <description>ADC_SAMPT3</description>
  <addressOffset>0x5c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000000f</resetMask>
  <fields>
    <field>
      <name>SAMP</name>
      <description>SAMP</description>
      <bitOffset>0</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SAMPSEL</name>
      <description>SAMPSEL</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
