Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G452.svd
<register>
  <name>GPIOx_DS_CFG</name>
  <displayName>GPIOx_DS_CFG</displayName>
  <description>GPIOx_DS_CFG</description>
  <addressOffset>0x20</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x0000f03f</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DS_CFG0</name>
      <description>DS_CFG0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG1</name>
      <description>DS_CFG1</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG2</name>
      <description>DS_CFG2</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG3</name>
      <description>DS_CFG3</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG4</name>
      <description>DS_CFG4</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG5</name>
      <description>DS_CFG5</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG6</name>
      <description>DS_CFG6</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG7</name>
      <description>DS_CFG7</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG8</name>
      <description>DS_CFG8</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG9</name>
      <description>DS_CFG9</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG10</name>
      <description>DS_CFG10</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG11</name>
      <description>DS_CFG11</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG12</name>
      <description>DS_CFG12</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG13</name>
      <description>DS_CFG13</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG14</name>
      <description>DS_CFG14</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DS_CFG15</name>
      <description>DS_CFG15</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>GPIOx_SR_CFG</name>
  <displayName>GPIOx_SR_CFG</displayName>
  <description>GPIOx_SR_CFG</description>
  <addressOffset>0x24</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x0000023f</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>SR_CFG0</name>
      <description>SR_CFG0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG1</name>
      <description>SR_CFG1</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG2</name>
      <description>SR_CFG2</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG3</name>
      <description>SR_CFG3</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG4</name>
      <description>SR_CFG4</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG5</name>
      <description>SR_CFG5</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG6</name>
      <description>SR_CFG6</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG7</name>
      <description>SR_CFG7</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG8</name>
      <description>SR_CFG8</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG9</name>
      <description>SR_CFG9</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG10</name>
      <description>SR_CFG10</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG11</name>
      <description>SR_CFG11</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG12</name>
      <description>SR_CFG12</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG13</name>
      <description>SR_CFG13</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG14</name>
      <description>SR_CFG14</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SR_CFG15</name>
      <description>SR_CFG15</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
</registers>

</peripheral>
<peripheral derivedFrom="GPIOA">
    <name>GPIOB</name>
    <baseAddress>0x40010C00</baseAddress>
</peripheral>
<peripheral derivedFrom="GPIOA">
    <name>GPIOC</name>
    <baseAddress>0x40011000</baseAddress>
</peripheral>
<peripheral derivedFrom="GPIOA">
    <name>GPIOD</name>
    <baseAddress>0x40011400</baseAddress>
</peripheral>
<peripheral derivedFrom="GPIOA">
    <name>GPIOE</name>
    <baseAddress>0x40011800</baseAddress>
</peripheral>
