Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G452.svd
</registers>

</peripheral>

<peripheral>
    <name>RCC</name>
    <description>Reset and clock control</description>
    <groupName>RCC</groupName>
    <baseAddress>0x40021000</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x40</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>RCC</name>
        <description>RCC interrupt</description>
        <value>5</value>
    </interrupt>
    <registers>
<register>
  <name>RCC_CTRL</name>
  <displayName>RCC_CTRL</displayName>
  <description>RCC_CTRL</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000083</resetValue>
  <resetMask>0x030ffffb</resetMask>
  <fields>
    <field>
      <name>HSIEN</name>
      <description>HSIEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HSIRDF</name>
      <description>HSIRDF</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HSITRIM</name>
      <description>HSITRIM</description>
      <bitOffset>3</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>HSICAL</name>
      <description>HSICAL</description>
      <bitOffset>8</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>HSEEN</name>
      <description>HSEEN</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HSERDF</name>
      <description>HSERDF</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HSEBP</name>
      <description>HSEBP</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CLKSSEN</name>
      <description>CLKSSEN</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLLEN</name>
      <description>PLLEN</description>
      <bitOffset>24</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLLRDF</name>
      <description>PLLRDF</description>
      <bitOffset>25</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RCC_CFG</name>
  <displayName>RCC_CFG</displayName>
  <description>RCC_CFG</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x20000000</resetValue>
  <resetMask>0xffff3fff</resetMask>
  <fields>
    <field>
      <name>SCLKSW</name>
      <description>SCLKSW</description>
      <bitOffset>0</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>SCLKSTS</name>
      <description>SCLKSTS</description>
      <bitOffset>2</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>AHBPRES</name>
      <description>AHBPRES</description>
      <bitOffset>4</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>APB1PRES</name>
      <description>APB1PRES</description>
      <bitOffset>8</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>APB2PRES</name>
      <description>APB2PRES</description>
      <bitOffset>11</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>PLLSRC</name>
      <description>PLLSRC</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLLHSEPRES</name>
      <description>PLLHSEPRES</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLLMULFCT</name>
      <description>PLLMULFCT</description>
      <bitOffset>18</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>USBPRES</name>
      <description>USBPRES</description>
      <bitOffset>22</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MCO</name>
      <description>MCO</description>
      <bitOffset>24</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>PLLMULFCT_H</name>
      <description>PLLMULFCT_H</description>
      <bitOffset>27</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MCOPRES</name>
      <description>MCOPRES</description>
      <bitOffset>28</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RCC_CLKINT</name>
  <displayName>RCC_CLKINT</displayName>
  <description>RCC_CLKINT</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x009f1f9f</resetMask>
  <fields>
    <field>
      <name>LSIRDIF</name>
      <description>LSIRDIF</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSERDIF</name>
      <description>LSERDIF</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HSIRDIF</name>
      <description>HSIRDIF</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HSERDIF</name>
      <description>HSERDIF</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLLRDIF</name>
      <description>PLLRDIF</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CLKSSIF</name>
      <description>CLKSSIF</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSIRDIEN</name>
      <description>LSIRDIEN</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSERDIEN</name>
      <description>LSERDIEN</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HSIRDIEN</name>
      <description>HSIRDIEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HSERDIEN</name>
      <description>HSERDIEN</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLLRDIEN</name>
      <description>PLLRDIEN</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSIRDICLR</name>
      <description>LSIRDICLR</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSERDICLR</name>
      <description>LSERDICLR</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HSIRDICLR</name>
      <description>HSIRDICLR</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HSERDICLR</name>
      <description>HSERDICLR</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLLRDICLR</name>
      <description>PLLRDICLR</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CLKSSICLR</name>
      <description>CLKSSICLR</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RCC_APB2PRST</name>
  <displayName>RCC_APB2PRST</displayName>
  <description>RCC_APB2PRST</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x001f79fd</resetMask>
  <fields>
    <field>
      <name>AFIORST</name>
      <description>AFIORST</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IOPARST</name>
      <description>IOPARST</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IOPBRST</name>
      <description>IOPBRST</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IOPCRST</name>
      <description>IOPCRST</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IOPDRST</name>
      <description>IOPDRST</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IOPERST</name>
      <description>IOPERST</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IOPFRST</name>
      <description>IOPFRST</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IOPGRST</name>
      <description>IOPGRST</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TIM1RST</name>
      <description>TIM1RST</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SPI1RST</name>
      <description>SPI1RST</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TIM8RST</name>
      <description>TIM8RST</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>USART1RST</name>
      <description>USART1RST</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DVPRST</name>
      <description>DVPRST</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>UART6RST</name>
      <description>UART6RST</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>UART7RST</name>
      <description>UART7RST</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>I2C3RST</name>
      <description>I2C3RST</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>I2C4RST</name>
      <description>I2C4RST</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RCC_APB1PRST</name>
  <displayName>RCC_APB1PRST</displayName>
  <description>RCC_APB1PRST</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x3efecc3f</resetMask>
  <fields>
    <field>
      <name>TIM2RST</name>
      <description>TIM2RST</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TIM3RST</name>
      <description>TIM3RST</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TIM4RST</name>
      <description>TIM4RST</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TIM5RST</name>
      <description>TIM5RST</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TIM6RST</name>
      <description>TIM6RST</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TIM7RST</name>
      <description>TIM7RST</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSCRST</name>
      <description>TSCRST</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WWDGRST</name>
      <description>WWDGRST</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SPI2RST</name>
      <description>SPI2RST</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SPI3RST</name>
      <description>SPI3RST</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>USART2RST</name>
      <description>USART2RST</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>USART3RST</name>
      <description>USART3RST</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>UART4RST</name>
      <description>UART4RST</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>UART5RST</name>
      <description>UART5RST</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>I2C1RST</name>
      <description>I2C1RST</description>
      <bitOffset>21</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>I2C2RST</name>
      <description>I2C2RST</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>USBRST</name>
      <description>USBRST</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CAN1RST</name>
      <description>CAN1RST</description>
      <bitOffset>25</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CAN2RST</name>
      <description>CAN2RST</description>
      <bitOffset>26</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BKPRST</name>
      <description>BKPRST</description>
      <bitOffset>27</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PWRRST</name>
      <description>PWRRST</description>
      <bitOffset>28</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DACRST</name>
      <description>DACRST</description>
      <bitOffset>29</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RCC_AHBPCLKEN</name>
  <displayName>RCC_AHBPCLKEN</displayName>
  <description>RCC_AHBPCLKEN</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000014</resetValue>
  <resetMask>0x0003ff57</resetMask>
  <fields>
    <field>
      <name>DMA1EN</name>
      <description>DMA1EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DMA2EN</name>
      <description>DMA2EN</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SRAMEN</name>
      <description>SRAMEN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FLITFEN</name>
      <description>FLITFEN</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CRCEN</name>
      <description>CRCEN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RNGCEN</name>
      <description>RNGCEN</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SDIOEN</name>
      <description>SDIOEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SACEN</name>
      <description>SACEN</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ADC1EN</name>
      <description>ADC1EN</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ADC2EN</name>
      <description>ADC2EN</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ADC3EN</name>
      <description>ADC3EN</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ADC4EN</name>
      <description>ADC4EN</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ETHMACEN</name>
      <description>ETHMACEN</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>QSPIEN</name>
      <description>QSPIEN</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RCC_APB2PCLKEN</name>
  <displayName>RCC_APB2PCLKEN</displayName>
  <description>RCC_APB2PCLKEN</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x001f79fd</resetMask>
  <fields>
    <field>
      <name>AFIOEN</name>
      <description>AFIOEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IOPAEN</name>
      <description>IOPAEN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IOPBEN</name>
      <description>IOPBEN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IOPCEN</name>
      <description>IOPCEN</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IOPDEN</name>
      <description>IOPDEN</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IOPEEN</name>
      <description>IOPEEN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IOPFEN</name>
      <description>IOPFEN</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IOPGEN</name>
      <description>IOPGEN</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TIM1EN</name>
      <description>TIM1EN</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SPI1EN</name>
      <description>SPI1EN</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TIM8EN</name>
      <description>TIM8EN</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>USART1EN</name>
      <description>USART1EN</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DVPEN</name>
      <description>DVPEN</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>UART6EN</name>
      <description>UART6EN</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>UART7EN</name>
      <description>UART7EN</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>I2C3EN</name>
      <description>I2C3EN</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>I2C4EN</name>
      <description>I2C4EN</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RCC_APB1PCLKEN</name>
  <displayName>RCC_APB1PCLKEN</displayName>
  <description>RCC_APB1PCLKEN</description>
  <addressOffset>0x1c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xbefeccff</resetMask>
  <fields>
    <field>
      <name>TIM2EN</name>
      <description>TIM2EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TIM3EN</name>
      <description>TIM3EN</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TIM4EN</name>
      <description>TIM4EN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TIM5EN</name>
      <description>TIM5EN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TIM6EN</name>
      <description>TIM6EN</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TIM7EN</name>
      <description>TIM7EN</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>COMPEN</name>
      <description>COMPEN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>COMPFILTEN</name>
      <description>COMPFILTEN</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSCEN</name>
      <description>TSCEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WWDGEN</name>
      <description>WWDGEN</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SPI2EN</name>
      <description>SPI2EN</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SPI3EN</name>
      <description>SPI3EN</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>USART2EN</name>
      <description>USART2EN</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>USART3EN</name>
      <description>USART3EN</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>UART4EN</name>
      <description>UART4EN</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>UART5EN</name>
      <description>UART5EN</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>I2C1EN</name>
      <description>I2C1EN</description>
      <bitOffset>21</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>I2C2EN</name>
      <description>I2C2EN</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>USBEN</name>
      <description>USBEN</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CAN1EN</name>
      <description>CAN1EN</description>
      <bitOffset>25</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CAN2EN</name>
      <description>CAN2EN</description>
      <bitOffset>26</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BKPEN</name>
      <description>BKPEN</description>
      <bitOffset>27</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PWREN</name>
      <description>PWREN</description>
      <bitOffset>28</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DACEN</name>
      <description>DACEN</description>
      <bitOffset>29</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OPAMPEN</name>
      <description>OPAMPEN</description>
      <bitOffset>31</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
