Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G452.svd
</registers>

</peripheral>

<peripheral>
    <name>USART1</name>
    <description>Universal synchronous asynchronous receiver transmitter</description>
    <groupName>USART</groupName>
    <baseAddress>0x40013800</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>USART1</name>
        <description>USART1 global interrupt</description>
        <value>37</value>
    </interrupt>
    <registers>
<register>
  <name>USART_STS</name>
  <displayName>USART_STS</displayName>
  <description>USART_STS</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x000000c0</resetValue>
  <resetMask>0x000003ff</resetMask>
  <fields>
    <field>
      <name>PEF</name>
      <description>PEF</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FEF</name>
      <description>FEF</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>NEF</name>
      <description>NEF</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OREF</name>
      <description>OREF</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IDLEF</name>
      <description>IDLEF</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXDNE</name>
      <description>RXDNE</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXC</name>
      <description>TXC</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXDE</name>
      <description>TXDE</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LINBDF</name>
      <description>LINBDF</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTSF</name>
      <description>CTSF</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>USART_DAT</name>
  <displayName>USART_DAT</displayName>
  <description>USART_DAT</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000001ff</resetMask>
  <fields>
    <field>
      <name>DATV</name>
      <description>DATV</description>
      <bitOffset>0</bitOffset>
      <bitWidth>9</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>USART_BRCF</name>
  <displayName>USART_BRCF</displayName>
  <description>USART_BRCF</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DIV_Decimal</name>
      <description>DIV_Decimal</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>DIV_Integer</name>
      <description>DIV_Integer</description>
      <bitOffset>4</bitOffset>
      <bitWidth>12</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>USART_CTRL1</name>
  <displayName>USART_CTRL1</displayName>
  <description>USART_CTRL1</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00003fff</resetMask>
  <fields>
    <field>
      <name>SDBRK</name>
      <description>SDBRK</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RCVWU</name>
      <description>RCVWU</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXEN</name>
      <description>RXEN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXEN</name>
      <description>TXEN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IDLEIEN</name>
      <description>IDLEIEN</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXDNEIEN</name>
      <description>RXDNEIEN</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXCIEN</name>
      <description>TXCIEN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXDEIEN</name>
      <description>TXDEIEN</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PEIEN</name>
      <description>PEIEN</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PSEL</name>
      <description>PSEL</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PCEN</name>
      <description>PCEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WUM</name>
      <description>WUM</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WL</name>
      <description>WL</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>UEN</name>
      <description>UEN</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>USART_CTRL2</name>
  <displayName>USART_CTRL2</displayName>
  <description>USART_CTRL2</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00007f6f</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>LINBDL</name>
      <description>LINBDL</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LINBDIEN</name>
      <description>LINBDIEN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LBCLK</name>
      <description>LBCLK</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CLKPHA</name>
      <description>CLKPHA</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CLKPOL</name>
      <description>CLKPOL</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CLKEN</name>
      <description>CLKEN</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>STPB</name>
      <description>STPB</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>LINMEN</name>
      <description>LINMEN</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>USART_CTRL3</name>
  <displayName>USART_CTRL3</displayName>
  <description>USART_CTRL3</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000007ff</resetMask>
  <fields>
    <field>
      <name>ERRIEN</name>
      <description>ERRIEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IRDAMEN</name>
      <description>IRDAMEN</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IRDALP</name>
      <description>IRDALP</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HDMEN</name>
      <description>HDMEN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SCNACK</name>
      <description>SCNACK</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SCMEN</name>
      <description>SCMEN</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DMARXEN</name>
      <description>DMARXEN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DMATXEN</name>
      <description>DMATXEN</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RTSEN</name>
      <description>RTSEN</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTSEN</name>
      <description>CTSEN</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTSIEN</name>
      <description>CTSIEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>USART_GTP</name>
  <displayName>USART_GTP</displayName>
  <description>USART_GTP</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>PSCV</name>
      <description>PSCV</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>GTV</name>
      <description>GTV</description>
      <bitOffset>8</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
